tests/data/pisofoam_restart/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
686
(
2.94958865183807209e-07
2.948073387264125e-07
2.95237744811070745e-07
2.9606517825631599e-07
2.97709529603587283e-07
3.1496321306764571e-07
1.66168108172301779e-06
2.95023000012694993e-07
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            fixedValue;
        value           uniform 1.00000000000000004e-10;
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            fixedValue;
        value           uniform 2.99999999999999986e-07;
    }
    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
