tests/data/pisofoam_restart/0/nuTilda_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
686
(
2.94979515131322029e-07
2.94825332533975878e-07
2.95496167713511105e-07
2.96197505383111064e-07
2.98105641993120274e-07
3.15335218993317371e-07
1.64478391667020911e-06
2.94984165117967952e-07
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            fixedValue;
        value           uniform 1.00000000000000004e-10;
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            fixedValue;
        value           uniform 2.99999999999999986e-07;
    }
    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
